PANDAS

In [1]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

# Read the CSV file
df =pd.read_csv(url)

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked' ]]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [9]:
df.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [10]:
df.dtypes == 'float64'

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin          False
Embarked       False
dtype: bool

In [11]:
df[df.dtypes[df.dtypes == 'float64'].index]

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [12]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [13]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
df[['Ticket']]

               Ticket
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
..                ...
886            211536
887            112053
888        W./C. 6607
889            111369
890            370376

[891 rows x 1 columns]

In [15]:
df[['Ticket']][4:16:2]

       Ticket
4      373450
6       17463
8      347742
10    PP 9549
12  A/5. 2151
14     350406

In [16]:
df[['Cabin', 'Ticket']]

    Cabin            Ticket
0     NaN         A/5 21171
1     C85          PC 17599
2     NaN  STON/O2. 3101282
3    C123            113803
4     NaN            373450
..    ...               ...
886   NaN            211536
887   B42            112053
888   NaN        W./C. 6607
889  C148            111369
890   NaN            370376

[891 rows x 2 columns]

In [17]:
df["Amul's_col"] = 2

In [18]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,2
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,2

In [19]:
df.insert(loc = 6, column ='Jake', value= 1)

In [20]:
df.insert(loc =3 , column = 'Jane', value =0)

In [21]:
df

,PassengerId,Survived,Pclass,Jane,Name,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,0,3,0,"Braund, Mr. Owen Harris",male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,0,"Heikkinen, Miss. Laina",female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,0,113803,53.1000,C123,S,2
4,5,0,3,0,"Allen, Mr. William Henry",male,35.0,1,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,"Montvila, Rev. Juozas",male,27.0,1,0,0,211536,13.0000,NaN,S,2
887,888,1,1,0,"Graham, Miss. Margaret Edith",female,19.0,1,0,0,112053,30.0000,B42,S,2
888,889,0,3,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,0,"Behr, Mr. Karl Howell",male,26.0,1,0,0,111369,30.0000,C148,C,2
890,891,0,3,0,"Dooley, Mr. Patrick",male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [22]:
df.insert(loc =5 , column = 'Equipments', value = "Oxygen Cylinders")

In [23]:
df

,PassengerId,Survived,Pclass,Jane,Name,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,0,3,0,"Braund, Mr. Owen Harris",Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,0,"Heikkinen, Miss. Laina",Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Oxygen Cylinders,female,35.0,1,1,0,113803,53.1000,C123,S,2
4,5,0,3,0,"Allen, Mr. William Henry",Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,"Montvila, Rev. Juozas",Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
887,888,1,1,0,"Graham, Miss. Margaret Edith",Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
888,889,0,3,0,"Johnston, Miss. Catherine Helen ""Carrie""",Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,1,0,"Behr, Mr. Karl Howell",Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
890,891,0,3,0,"Dooley, Mr. Patrick",Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [24]:
a = df['Name'][0:5]
type(a)
a

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [25]:
l = ['Homies', 'a1', 'a2', 'a3', 'a4']
pd.Series(a, index = l)

Homies    NaN
a1        NaN
a2        NaN
a3        NaN
a4        NaN
Name: Name, dtype: object

In [26]:
pd.Series(list(a), index = l)

Homies                              Braund, Mr. Owen Harris
a1        Cumings, Mrs. John Bradley (Florence Briggs Th...
a2                                   Heikkinen, Miss. Laina
a3             Futrelle, Mrs. Jacques Heath (Lily May Peel)
a4                                 Allen, Mr. William Henry
dtype: object

In [27]:
s1 = pd.Series(['Amul', 'Kushal', 'Ary', 'Shiks', 'Ganu'], index= l)
s1

Homies      Amul
a1        Kushal
a2           Ary
a3         Shiks
a4          Ganu
dtype: object

In [28]:
s2 = pd.Series(['Ayash', 'Nona', 'Kumar', 'Ram', 'Rishi'], index = [1,2,3,4,5])
s2

1    Ayash
2     Nona
3    Kumar
4      Ram
5    Rishi
dtype: object

In [29]:
m3 = pd.concat([s1,s2])
m3

Homies      Amul
a1        Kushal
a2           Ary
a3         Shiks
a4          Ganu
1          Ayash
2           Nona
3          Kumar
4            Ram
5          Rishi
dtype: object

In [30]:

s1*s2

Homies    NaN
a1        NaN
a2        NaN
a3        NaN
a4        NaN
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
dtype: object

In [31]:
m3[1]

'Ayash'

In [32]:
df.drop("Survived", axis =1, inplace = True)
df

,PassengerId,Pclass,Jane,Name,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,3,0,"Braund, Mr. Owen Harris",Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
2,3,3,0,"Heikkinen, Miss. Laina",Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Oxygen Cylinders,female,35.0,1,1,0,113803,53.1000,C123,S,2
4,5,3,0,"Allen, Mr. William Henry",Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,0,"Montvila, Rev. Juozas",Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
887,888,1,0,"Graham, Miss. Margaret Edith",Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
888,889,3,0,"Johnston, Miss. Catherine Helen ""Carrie""",Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,0,"Behr, Mr. Karl Howell",Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
890,891,3,0,"Dooley, Mr. Patrick",Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [33]:
df.drop(3, inplace=True)
df

,PassengerId,Pclass,Jane,Name,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,3,0,"Braund, Mr. Owen Harris",Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
2,3,3,0,"Heikkinen, Miss. Laina",Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
4,5,3,0,"Allen, Mr. William Henry",Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
5,6,3,0,"Moran, Mr. James",Oxygen Cylinders,male,NaN,1,0,0,330877,8.4583,NaN,Q,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,0,"Montvila, Rev. Juozas",Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
887,888,1,0,"Graham, Miss. Margaret Edith",Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
888,889,3,0,"Johnston, Miss. Catherine Helen ""Carrie""",Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,0,"Behr, Mr. Karl Howell",Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
890,891,3,0,"Dooley, Mr. Patrick",Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [34]:
df.set_index("Name")

,PassengerId,Pclass,Jane,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
Name,,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,3,0,Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,0,Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
"Heikkinen, Miss. Laina",3,3,0,Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
"Allen, Mr. William Henry",5,3,0,Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
"Moran, Mr. James",6,3,0,Oxygen Cylinders,male,NaN,1,0,0,330877,8.4583,NaN,Q,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,2,0,Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
"Graham, Miss. Margaret Edith",888,1,0,Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
"Johnston, Miss. Catherine Helen ""Carrie""",889,3,0,Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
"Behr, Mr. Karl Howell",890,1,0,Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
"Dooley, Mr. Patrick",891,3,0,Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [35]:
df

,PassengerId,Pclass,Jane,Name,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
0,1,3,0,"Braund, Mr. Owen Harris",Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
2,3,3,0,"Heikkinen, Miss. Laina",Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
4,5,3,0,"Allen, Mr. William Henry",Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
5,6,3,0,"Moran, Mr. James",Oxygen Cylinders,male,NaN,1,0,0,330877,8.4583,NaN,Q,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,0,"Montvila, Rev. Juozas",Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
887,888,1,0,"Graham, Miss. Margaret Edith",Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
888,889,3,0,"Johnston, Miss. Catherine Helen ""Carrie""",Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
889,890,1,0,"Behr, Mr. Karl Howell",Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
890,891,3,0,"Dooley, Mr. Patrick",Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

In [36]:
df.set_index("Name", inplace = True)

In [37]:
df

,PassengerId,Pclass,Jane,Equipments,Sex,Age,Jake,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Amul's_col
Name,,,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,3,0,Oxygen Cylinders,male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,2
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,0,Oxygen Cylinders,female,38.0,1,1,0,PC 17599,71.2833,C85,C,2
"Heikkinen, Miss. Laina",3,3,0,Oxygen Cylinders,female,26.0,1,0,0,STON/O2. 3101282,7.9250,NaN,S,2
"Allen, Mr. William Henry",5,3,0,Oxygen Cylinders,male,35.0,1,0,0,373450,8.0500,NaN,S,2
"Moran, Mr. James",6,3,0,Oxygen Cylinders,male,NaN,1,0,0,330877,8.4583,NaN,Q,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,2,0,Oxygen Cylinders,male,27.0,1,0,0,211536,13.0000,NaN,S,2
"Graham, Miss. Margaret Edith",888,1,0,Oxygen Cylinders,female,19.0,1,0,0,112053,30.0000,B42,S,2
"Johnston, Miss. Catherine Helen ""Carrie""",889,3,0,Oxygen Cylinders,female,NaN,1,1,2,W./C. 6607,23.4500,NaN,S,2
"Behr, Mr. Karl Howell",890,1,0,Oxygen Cylinders,male,26.0,1,0,0,111369,30.0000,C148,C,2
"Dooley, Mr. Patrick",891,3,0,Oxygen Cylinders,male,32.0,1,0,0,370376,7.7500,NaN,Q,2

# Making a Dataframe from a Dictionary

In [42]:
d =  {"key1" : [1,2,3,4,5],
      "key2": [6,7,8,9,10],
      "key3": [11,12,13,14,15]}

print(d)

{'key1': [1, 2, 3, 4, 5], 'key2': [6, 7, 8, 9, 10], 'key3': [11, 12, 13, 14, 15]}

In [43]:
pd.DataFrame(d)

   key1  key2  key3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15

# It's time for DATA CLEANING!

In [46]:
# Direct URL to the raw CSV file
url = "https://raw.githubusercontent.com/OpenTreeOfLife/reference-taxonomy/master/inclusions.csv"

# Read the CSV file
df1 = pd.read_csv(url)

In [47]:
df1

,Pista wui,Annelida,105938,Unnamed: 3
0,Rebecca salina,Haptophyta,168560,NaN
1,Ulnaria acus,Eukaryota,992764,a.k.a. Synedra acus
2,Tuber indicum,Fungi,766380,NaN
3,Rhysida nuda,Arthropoda,849378,NaN
4,Car pini,Coleoptera,444291,NaN
...,...,...,...,...
106,Acropora,Cnidaria,712401,issue reftax#298
107,Acropora,Bryozoa,4149092,issue reftax#298 (syn of Porina)
108,Dermocystidium salmonis,Ichthyosporea,5653696,issue reftax #301
109,Corymorpha,Cnidaria,183501,fallout from setting Cnidarian priority
110,Corymorpha,Nematoda,860265,fallout from setting Cnidarian priority